{
	"document_title": "IPMI network LAN interface failover operational risk",
	"document_type": "Fortinet PSIRT Advisories",
	"documentpublisher": {
		"type": "Vendor",
		"contact_details": "\n            Fortinet PSIRT Contact:\n            Website: https://fortiguard.fortinet.com/faq/psirt-contact\n        "
	},
	"documenttracking": {
		"identification": {
			"id": "FG-IR-17-195"
		},
		"status": "Final",
		"version": "1",
		"revisionhistory": {
			"revision": {
				"number": "1",
				"date": "2019-09-17T00:00:00",
				"description": "Current version"
			}
		},
		"initial_release_date": "2019-09-17T00:00:00",
		"current_release_date": "2019-09-17T00:00:00"
	},
	"documentnotes": {
		"note": [
			{
				"text": "\n            Some models of FortiAnalyzer and FortiManager have a default setting of \"Failover\", for remote IPMI access; this means that if no cable is plugged in the IPMI port, the IPMI implementation will request an IP address on the regular LAN port of the device, via DHCP requests.Should such a DHCP request succeed, access to the IPMI web GUI is then possible on the granted IP address, via the regular LAN port of the device.This presents an operational risk, as this default behavior may not be known or understood by administrators of the device; the latter risk is more important if the default IPMI admin passwords have not been changed.\n        ",
				"title": "Summary",
				"type": "Summary",
				"ordinal": "1"
			},
			{
				"text": "\n            Potential Unauthorized Access to the IPMI interface\n        ",
				"title": "Impact",
				"type": "General",
				"ordinal": "2"
			},
			{
				"text": "\n            FortiAnalyzer models:FAZ-400E, FAZ-1000E, FAZ-2000E, FAZ-3000F, FAZ-3500F, FAZ-3700FFortiManager models:FMG-300E, FMG-400E, FMG-2000E, FMG-3000FOther models and Fortinet products are confirmed to not have a default Failover setting.\n        ",
				"title": "Affected Products",
				"type": "General",
				"ordinal": "3"
			},
			{
				"text": "\n            IPMI firmware has been updated to avoid that potential operational risk, and production shipments after July 2017 do not present that risk. For customer using affected models, Fortinet PSIRT suggests checking the IPMI interface settings and making sure the IPMI port option is set to \"Dedicated\" instead of \"Failover\". The procedure is detailed in this document entry: https://docs.fortinet.com/document/fortimanager/hardware/disable-the-ipmi-port/ As a measure of precaution, and regardless the product, when an IPMI port is present, we also suggest to not leave the IPMI interface admin password to its default value. The procedure to change it is detailed in this document entry: https://docs.fortinet.com/document/fortimanager/hardware/change-the-ipmi-port-password/\n        ",
				"title": "Solutions",
				"type": "General",
				"ordinal": "4"
			}
		]
	},
	"document_references": {},
	"acknowledgments": {
		"acknowledgment": [
			{
				"description": "Fortinet is pleased to thank \"taNET GmbH\", \"BOLL Engineering AG\" and \"CIC Consulting Informatico\" for reporting this operational risk under responsible disclosure."
			}
		]
	},
	"vulnerability": {
		"ordinal": "1",
		"title": "IPMI network LAN interface failover operational risk",
		"references": {
			"type": "Self",
			"reference": [
				{
					"url": "https://fortiguard.fortinet.com/psirt/FG-IR-17-195",
					"description": "IPMI network LAN interface failover operational risk"
				}
			]
		},
		"product_statuses": {
			"status": {}
		},
		"cvss_scoresets": {
			"scoreset_v3": {
				"base_score_v3": "0"
			}
		}
	},
	"product_tree": {
		"branch": {}
	}
}
